-- Добавление факультетов
INSERT INTO Faculty (name, foundation_year) VALUES
('ИИКС', 1995),
('ИФТЭБ', 1980),
('ИМО', 1975),
('ВИШ', 2017);

-- Добавление студентов
INSERT INTO Student (full_name, birth_date, faculty_id, email) VALUES
('Котов Алексей Петрович', '2000-05-15', 1, 'kotov@university.ru'),
('Петрова Мария Сергеевна', '2001-03-20', 1, 'petrova@university.ru'),
('Кулагин Дмитрий Иванович', '2000-11-10', 1, 'kulagin@university.ru'),
('Смирнова Анна Владимировна', '2001-07-05', 2, 'smirnova@university.ru'),
('Николаев Павел Олегович', '2000-12-25', 2, 'nikolaev@university.ru'),
('Федорова Елена Дмитриевна', '2001-02-14', 3, 'fedorova@university.ru'),
('Кудрявцев Егор Павлович', '2005-02-14', 4, 'kudravcev@university.ru');

-- Добавление курсов
INSERT INTO Course (name, credits, faculty_id) VALUES
('Программирование на Python', 5, 1),
('Базы данных', 6, 1),
('Веб-разработка', 4, 1),
('Микроэкономика', 5, 2),
('Бухгалтерский учет', 6, 2),
('История русской литературы', 4, 3),
('Системный анализ', 5, 4);

-- Добавление записей о зачислениях
INSERT INTO Enrollment (student_id, course_id, enroll_date) VALUES
-- Котов записан на 2 курса
(1, 1, '2023-09-01'),
(1, 2, '2023-09-01'),
-- Петрова записана на 1 курс
(2, 1, '2023-09-01'),
-- Кулагин записан на 3 курса
(3, 1, '2023-09-01'),
(3, 2, '2023-09-01'),
(3, 3, '2023-09-01'),
-- Смирнова записана на 2 курса
(4, 4, '2023-09-01'),
(4, 5, '2023-09-01'),
-- Николаев записан на 1 курс
(5, 4, '2023-09-01'),
-- Федорова записана на 1 курс
(6, 6, '2023-09-01'),
-- Кудрявцев записана на 1 курс
(7, 7, '2023-09-01');